stm32-hotspot/STM32WBA-BLE-Enhanced-ATT/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_App_EATT_central/STM32_WPAN/App/app_ble.c
              bleAppContext.deviceServerFound = 0x01;
              
              LOG_INFO_APP("-- EATT peripheral, db addr 0x%02X:%02X:%02X:%02X:%02X:%02X\n",
                              bleAppContext.a_deviceServerBdAddr[5],
                              bleAppContext.a_deviceServerBdAddr[4],
                              bleAppContext.a_deviceServerBdAddr[3],
                              bleAppContext.a_deviceServerBdAddr[2],
                              bleAppContext.a_deviceServerBdAddr[1],
                              bleAppContext.a_deviceServerBdAddr[0]);
              found_status = 1;
            }
            else
            {
              LOG_INFO_APP("-- EATT peripheral not detected\n");
            }
            
          }
          break;
        default:
          break;
        }/* end of switch*/
      
      i += ad_length + 1; /* increment the iterator to go on next element*/
      /*
      if (found_status != 0)
      {
        break;
      }
      */
    }/* end of while*/
  }
  
  return found_status;
}

static void Scan_Request(void)
{
  tBleStatus result;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    BSP_LED_On(LED_BLUE);

    result = aci_gap_start_general_discovery_proc(SCAN_INT_MS(500u), SCAN_WIN_MS(500u), CFG_BD_ADDRESS_TYPE, 1);
    if (result == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  ** START GENERAL DISCOVERY (SCAN) **\n");
    }
    else
    {
      BSP_LED_On(LED_RED);
      LOG_INFO_APP("-- BLE_App_Start_Limited_Disc_Req, Failed 0x%02X\n", result);
    }
  }
  BleStackCB_Process();
  return;
}

static void Connect_Request(void)
{
  tBleStatus result;
  

  if (bleAppContext.deviceServerFound != 0)
  {    
    result = aci_gap_create_connection(SCAN_INT_MS(500u), SCAN_WIN_MS(500u),
                                       GAP_PUBLIC_ADDR, 
                                       &bleAppContext.a_deviceServerBdAddr[0],
                                       GAP_PUBLIC_ADDR,
                                       CONN_INT_MS(50u), CONN_INT_MS(50u),
                                       0u,
                                       CONN_SUP_TIMEOUT_MS(5000u),
                                       CONN_CE_LENGTH_MS(50u), CONN_CE_LENGTH_MS(50u));      
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
      LOG_INFO_APP("==>> Success: Create connection to SC_WBAxx\n");
      UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_CONNECTION_COMPLETE);
      
    }
    else
    {
      LOG_INFO_APP("==>> Fail: Create connection to SC_WBAxx , result: 0x%02X\n", result);
      BSP_LED_On(LED_RED);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }      
  }
  return;
}

static void Central_security_request(void)
{
  tBleStatus status;
  status = aci_gap_send_pairing_req(bleAppContext.BleApplicationContext_legacy.connectionHandle, 0x00);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Pairing request cmd failure: 0x%02X\n", status);
  }
  else
  {
    LOG_INFO_APP("Pairing request cmd success\n");
  }
  BleStackCB_Process();
}

/* USER CODE END FD_WRAP_FUNCTIONS */
